common/models/Usuario.php

SELECT * FROM `Usuario` WHERE (`id`=15) AND (`status`=1)
---
    public static function findIdentity($id)
    {
        return static::findOne(['id' => $id, 'status' => self::STATUS_ACTIVE]);

SELECT * FROM `Usuario` WHERE `username`='joaocarvalho@miniportal.com.br'
---
    public static function findByUsername($username)
    {
        //return static::findOne(['username' => $username, 'status' => self::STATUS_ACTIVE]);
        return static::findOne(['username' => $username]);